app/controllers/admin/users_controller.rb

  def index
    @users = User.all.order('created_at DESC')
---
SELECT "users".* FROM "users" ORDER BY created_at DESC

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "admin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"