app/views/tasks/_form.html.erb

SELECT "labels".* FROM "labels" WHERE "labels"."user_id" = $1  [["user_id", 4]]
---
          <div class="field">
            <% current_user.labels.all.each do |label| %>