app/views/users/show.html.erb

    <tbody>
      <% @user.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 4]]

          <td><%= task.statut %></td>
          <td><em><% task.labels.each do |label|%>
---
SELECT "labels".* FROM "labels" INNER JOIN "labellings" ON "labels"."id" = "labellings"."label_id" WHERE "labellings"."task_id" = $1  [["task_id", 3]]

  <div class="label">
    <p><%current_user.labels.each do |label| %>
---
SELECT "labels".* FROM "labels" WHERE "labels"."user_id" = $1  [["user_id", 4]]