app/controllers/labels_controller.rb

INSERT INTO "labels" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "bjour"], ["created_at", "2020-10-15 14:11:36.505964"], ["updated_at", "2020-10-15 14:11:36.505964"], ["user_id", 4]]
---
    def create
      @label = Label.new (label_params)
      @label.user_id = current_user.id
      @label.save

DELETE FROM "labels" WHERE "labels"."id" = $1  [["id", 9]]
---
    def destroy
      @label.destroy

SELECT "labels".* FROM "labels" WHERE "labels"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_label
      @label = Label.find(params[:id])