app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."end_time" DESC LIMIT $2 OFFSET $3  [["user_id", 7], ["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 7]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."priority" DESC LIMIT $2 OFFSET $3  [["user_id", 4], ["LIMIT", 4], ["OFFSET", 0]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."statut" = $2 LIMIT $3 OFFSET $4  [["user_id", 7], ["statut", "0"], ["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."statut" = $1  [["statut", "0"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."name" = $2 AND "tasks"."statut" = $3 LIMIT $4 OFFSET $5  [["user_id", 6], ["name", "d"], ["statut", "0"], ["LIMIT", 4], ["OFFSET", 0]]
SELECT "tasks".* FROM "tasks" INNER JOIN "labellings" ON "labellings"."task_id" = "tasks"."id" INNER JOIN "labels" ON "labels"."id" = "labellings"."label_id" WHERE "tasks"."user_id" = $1 AND "labels"."id" = $2 ORDER BY "tasks"."created_at" DESC LIMIT $3 OFFSET $4  [["user_id", 4], ["id", 1], ["LIMIT", 4], ["OFFSET", 0]]
SELECT "labels".* FROM "labels" INNER JOIN "labellings" ON "labels"."id" = "labellings"."label_id" WHERE "labellings"."task_id" = $1  [["task_id", 3]]
---
  def index
    if params[:sort_expired]
      @tasks=current_user.tasks.all.order(end_time: :desc).page(params[:page]).per(4)
    elsif params[:sort_priority]
      @tasks=current_user.tasks.all.order(priority: :desc).page(params[:page]).per(4)
    elsif params[:name].blank? && params[:statut]
      @tasks = current_user.tasks.where(statut:params[:statut]).page(params[:page]).per(4)
    elsif params[:name] && params[:statut]
      @tasks = current_user.tasks.where(name: params[:name]).where(statut:params[:statut]).page(params[:page]).per(4)
    else
      @tasks=current_user.tasks.all.order(created_at: :desc).page(params[:page]).per(4)
    end
    @tasks = @tasks.joins(:labels).where(labels: { id: params[:label_id] }) if params[:label_id].present?

INSERT INTO "tasks" ("name", "content", "end_time", "created_at", "updated_at", "statut", "priority", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    #@task = Task.new (task_params)
    #@task.user_id = current_user.id
    @task =current_user.tasks.build(task_params)
    if @task.save

UPDATE "tasks" SET "detail" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["detail", "tontontotonto toiiii"], ["updated_at", "2020-09-26 20:20:56.873229"], ["id", 13]]
---
  def update
    if @task.update(task_params)