app/controllers/users_controller.rb

    def update
      if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "email" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["name", "pipo"], ["email", "pipo@gmail.com"], ["password_digest", "$2a$12$NJL8NyF/f3yJTwl5HdsGBefeTSz5CkFRVR86nWBoj/JJ.ZPaLXtyy"], ["updated_at", "2020-10-06 06:31:45.713352"], ["id", 4]]