app/models/user.rb

SELECT COUNT(*) FROM "users" WHERE "users"."admin" = $1  [["admin", true]]
---
    def destroy_admin
      if User.where(admin: true).count == 1

SELECT COUNT(*) FROM "users" WHERE "users"."admin" = $1  [["admin", true]]
SELECT "users".* FROM "users" WHERE "users"."admin" = $1  [["admin", true]]
---
    def update_admin
      if User.where(admin: true).count == 1 && admin == false
        user = User.where(admin: true)